app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."@today_book" = ? LIMIT ?  [["user_id", 1], ["@today_book", "Date.new"], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books
    @today_book=@books.where('@books': 'Date.new')